src/Documents/ИТ_УстановкаПланаПродаж_СтаршийМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_УстановкаПланаПродаж_СтаршийМенеджер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_ПланПродаж_День</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтаршийМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_УстановкаПланаПродаж_Месяц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиНаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_13</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_14</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_15</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_16</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_17</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_19</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_20</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_21</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_22</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_23</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_24</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_25</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_26</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_27</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_28</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_29</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_30</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_31</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРаспределения</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФактПрошлыйГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИТ_УстановкаПланаПродаж_СтаршийМенеджер/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Статус");	
	Поля.Добавить("СтаршийМенеджер");
	Поля.Добавить("ПериодПлана");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("План продаж старшего менеджера %1 № %2 от %3 на месяц: %4 (%5)",
					Данные.СтаршийМенеджер,
					Данные.Номер,
	                Формат(Данные.Дата, "ДЛФ=D"),
					Формат(Данные.ПериодПлана, "ДФ='ММММ гггг ''г.'''"),
					НРег(Данные.Статус));
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Полный комлект
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПланПродаж_КСогласованию";
	КомандаПечати.Представление = НСтр("ru = 'План продаж: К согласованию'");
	КомандаПечати.Порядок		= 10; 
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// ПРИКАЗ ОБ УДЕРЖАНИИ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПланПродаж_КСогласованию") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПланПродаж_КСогласованию", 
			"План продаж: К согласованию", 
			Печать_ПланПродаж_КСогласованию(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФункцииПечати

Функция Печать_ПланПродаж_КСогласованию(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ТабличныйДокумент = Неопределено)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПланПродаж_КСогласованию";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПФ_XML_ПланПродаж_КСогласованию");
	Область_Шапка			= Макет.ПолучитьОбласть("Шапка");
	Область_ПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	// Вывод данных
	Для Каждого ПланПродаж Из МассивОбъектов Цикл 
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		ДанныеПланаПродаж	= ПолучитьДанныеПланаПродаж(ПланПродаж);
		
		// Шапка
		Область_Шапка.Параметры.ПредставлениеДокумента	= ДанныеПланаПродаж.ПредставлениеДокумента; 
		Область_Шапка.Параметры.ДанныеФормирования		= СтрШаблон(
			"Сформировал: %1 от %2.",
			Строка(ПараметрыСеанса.ТекущийПользователь),
			Формат(ТекущаяДата(), "ДЛФ=DDT"));
			
		ТабличныйДокумент.Вывести(Область_Шапка);
		ТабличныйДокумент.Вывести(Область_ПустаяСтрока);
		
		// Данные плана продаж
		КлючКоличестваНедель = "Недель_" + Формат(ДанныеПланаПродаж.ДанныеНедель.Количество(), "ЧДЦ=0; ЧН=0; ЧГ=0");
		Область_ПланПродаж_Шапка	= Макет.ПолучитьОбласть(СтрШаблон("ПланПродаж_Шапка | %1",	КлючКоличестваНедель));
		Область_ПланПродаж_Строка	= Макет.ПолучитьОбласть(СтрШаблон("ПланПродаж_Строка | %1",	КлючКоличестваНедель));
		Область_ПланПродаж_Итог		= Макет.ПолучитьОбласть(СтрШаблон("ПланПродаж_Итог | %1",	КлючКоличестваНедель));
		
		Для Каждого СтрокаДанныхНедели Из ДанныеПланаПродаж.ДанныеНедель Цикл
			Область_ПланПродаж_Шапка.Параметры[СтрокаДанныхНедели.КлючКолонки]	= СтрокаДанныхНедели.ПредставлениеНедели;	
			Область_ПланПродаж_Итог.Параметры[СтрокаДанныхНедели.КлючЯчейки]	= ДанныеПланаПродаж.ТаблицаПланаПродаж.Итог(СтрокаДанныхНедели.КлючЯчейки);	
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(Область_ПланПродаж_Шапка);
		
		Для Каждого СтрокаПланаПродаж Из ДанныеПланаПродаж.ТаблицаПланаПродаж Цикл
			Если СтрокаПланаПродаж.Сумма_Отклонение < 0 Тогда 
				Область_ПланПродаж_Строка.Области.Сумма_Отклонение.ЦветТекста = Новый Цвет(255, 0, 0);	
			Иначе
				Область_ПланПродаж_Строка.Области.Сумма_Отклонение.ЦветТекста = Новый Цвет();	
			КонецЕсли;	
			
			Область_ПланПродаж_Строка.Параметры.Заполнить(СтрокаПланаПродаж);
			ТабличныйДокумент.Вывести(Область_ПланПродаж_Строка);
		КонецЦикла;	
		
		// Итоги
		Область_ПланПродаж_Итог.Параметры.Сумма_План					= ДанныеПланаПродаж.ТаблицаПланаПродаж.Итог("Сумма_План");
		Область_ПланПродаж_Итог.Параметры.Сумма_Распределено			= ДанныеПланаПродаж.ТаблицаПланаПродаж.Итог("Сумма_Распределено");
		Область_ПланПродаж_Итог.Параметры.Сумма_Отклонение				= ДанныеПланаПродаж.ТаблицаПланаПродаж.Итог("Сумма_Отклонение");
		Область_ПланПродаж_Итог.Параметры.Сумма_ПредыдущийГод			= ДанныеПланаПродаж.ТаблицаПланаПродаж.Итог("Сумма_ПредыдущийГод");
		Область_ПланПродаж_Итог.Параметры.Сумма_ОтклонениеПредыдущийГод	= ДанныеПланаПродаж.ТаблицаПланаПродаж.Итог("Сумма_ОтклонениеПредыдущийГод");
		Область_ПланПродаж_Итог.Параметры.Сумма_Факт_Период				= ДанныеПланаПродаж.ТаблицаПланаПродаж.Итог("Сумма_Факт_Период");
		ТабличныйДокумент.Вывести(Область_ПланПродаж_Итог);
		
		// Служебные
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ПланПродаж);
	КонецЦикла;	
	
	// Возврат
	Возврат ТабличныйДокумент;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МногократноВывестиОбласть(ТабличныйДокумент, ОбластьМакета, КоличествоВыводов)
	
	Для НомерВывода = 1 По КоличествоВыводов Цикл 
		Если ТипЗнч(ОбластьМакета) = Тип("Массив") Тогда 
			Для Каждого ОбластьМассива Из ОбластьМакета Цикл 
				ТабличныйДокумент.Вывести(ОбластьМассива);	
			КонецЦикла;	
		Иначе	
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
	КонецЦикла;	
	
КонецФункции	

Функция ПолучитьДанныеПланаПродаж(ПланПродаж)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка КАК ТорговаяТочка,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка.ЛинейныйМенеджер КАК ЛинейныйМенеджер,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаПлан,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_1,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_2,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_3,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_4,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_5,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_6,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_7,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_8,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_9,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_10,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_11,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_12,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_13,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_14,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_15,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_16,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_17,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_18,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_19,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_20,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_21,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_22,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_23,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_24,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_25,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_26,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_27,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_28,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_29,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_30,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_31,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаФактПрошлыйГод
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПланПродаж КАК ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж
		|ГДЕ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка = &ПланПродаж
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛинейныйМенеджер,
		|	ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ИТ_УстановкаПланаПродаж_СтаршийМенеджер.Ссылка) КАК ПредставлениеДокумента,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПериодПлана КАК ПериодПлана
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер КАК ИТ_УстановкаПланаПродаж_СтаршийМенеджер
		|ГДЕ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджер.Ссылка = &ПланПродаж";
	
	Запрос.УстановитьПараметр("ПланПродаж", ПланПродаж); 
	
	РезультатЗапроса	= Запрос.ВыполнитьПакет();
	СуммыПланаПродаж	= РезультатЗапроса.Получить(0).Выгрузить();
	ДанныеПланаПродаж	= РезультатЗапроса.Получить(1).Выбрать();
	
	
	Если ДанныеПланаПродаж.Следующий() Тогда
		ГодПлана		= Год(ДанныеПланаПродаж.ПериодПлана);
		МесяцПлана		= Месяц(ДанныеПланаПродаж.ПериодПлана);
		КоличествоДней	= День(КонецМесяца(ДанныеПланаПродаж.ПериодПлана));
		НомерНедели		= 1;
		
		// Данные дней
		ДанныеДней = Новый ТаблицаЗначений();		
		ДанныеДней.Колонки.Добавить("НомерДня",		Новый ОписаниеТипов("Число"));
		ДанныеДней.Колонки.Добавить("НомерНедели",	Новый ОписаниеТипов("Число"));
		ДанныеДней.Колонки.Добавить("ДатаНедели",	Новый ОписаниеТипов("Дата"));
		ДанныеДней.Колонки.Добавить("КлючКолонки",	ОбщегоНазначения.ОписаниеТипаСтрока(15));
		
		Для НомерДня = 1 По КоличествоДней Цикл 
			ДатаДня		= Дата(ГодПлана, МесяцПлана, НомерДня);
			ДеньНедели	= ДеньНедели(ДатаДня);
			
			СтрокаДня = ДанныеДней.Добавить();
			СтрокаДня.НомерДня		= НомерДня;
			СтрокаДня.НомерНедели	= НомерНедели;
			СтрокаДня.ДатаНедели	= НачалоНедели(ДатаДня);
			СтрокаДня.КлючКолонки	= "СуммаДень_" + Формат(НомерДня, "ЧДЦ=0; ЧН=0; ЧГ=0");
			
			Если ДеньНедели = 7 
				И НомерДня < КоличествоДней Тогда 
				НомерНедели = НомерНедели + 1;
			КонецЕсли;	
		КонецЦикла;
		
		// Таблица плана продаж
		КлючиКолонок = Новый Соответствие();
		ТаблицаПланаПродаж = Новый ТаблицаЗначений();
		ТаблицаПланаПродаж.Колонки.Добавить("ТорговаяТочка",					Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
		ТаблицаПланаПродаж.Колонки.Добавить("ЛинейныйМенеджер",					Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ТаблицаПланаПродаж.Колонки.Добавить("Сумма_План",						Новый ОписаниеТипов("Число"));
		ТаблицаПланаПродаж.Колонки.Добавить("Сумма_Распределено",				Новый ОписаниеТипов("Число"));
		ТаблицаПланаПродаж.Колонки.Добавить("Сумма_Отклонение",					Новый ОписаниеТипов("Число"));
		ТаблицаПланаПродаж.Колонки.Добавить("Сумма_ПредыдущийГод",				Новый ОписаниеТипов("Число"));
		ТаблицаПланаПродаж.Колонки.Добавить("Сумма_ОтклонениеПредыдущийГод",	Новый ОписаниеТипов("Число"));
		ТаблицаПланаПродаж.Колонки.Добавить("Сумма_Факт_Период",				Новый ОписаниеТипов("Число"));
		
		// Данные недель
		ДанныеНедель = ДанныеДней.Скопировать(, "НомерНедели,ДатаНедели");
		ДанныеНедель.Свернуть("НомерНедели,ДатаНедели");
		ДанныеНедель.Колонки.Добавить("ПредставлениеНедели",	ОбщегоНазначения.ОписаниеТипаСтрока(15));
		ДанныеНедель.Колонки.Добавить("КлючКолонки",			ОбщегоНазначения.ОписаниеТипаСтрока(15));
		ДанныеНедель.Колонки.Добавить("КлючЯчейки",				ОбщегоНазначения.ОписаниеТипаСтрока(15));
		
		Для Каждого ДанныеНедели Из ДанныеНедель Цикл 
			КлючКолонки	= "Период_Неделя_" + Формат(ДанныеНедели.НомерНедели, "ЧДЦ=0; ЧН=0; ЧГ=0");
			КлючЯчейки	= "Сумма_Неделя_" + Формат(ДанныеНедели.НомерНедели, "ЧДЦ=0; ЧН=0; ЧГ=0");
			
			ДанныеНедели.ПредставлениеНедели	= Формат(ДанныеНедели.ДатаНедели, "ДФ=дд.ММ") + " - " + Формат(КонецНедели(ДанныеНедели.ДатаНедели), "ДФ=дд.ММ");
			ДанныеНедели.КлючКолонки			= КлючКолонки;
			ДанныеНедели.КлючЯчейки				= КлючЯчейки;
			
			ТаблицаПланаПродаж.Колонки.Добавить(КлючЯчейки, Новый ОписаниеТипов("Число"));
			КлючиКолонок.Вставить(ДанныеНедели.НомерНедели, КлючЯчейки); 
		КонецЦикла;	
		
		// Фактические продажи за 3 последние недели
		НачалоПериода	= НачалоНедели(ТекущаяДата() - 21 * 86400);
		КонецПериода	= КонецНедели(НачалоПериода + 20 * 86400);
		ТорговыеТочки	= ИТ_ОбработкаДанных.ПолучитьУникальныеЗначенияКолонкиТаблицыЗначений(СуммыПланаПродаж, "ТорговаяТочка");
		ПродажиЗаПериод	= ИТ_ПланыПродаж_КлиентСервер.ПолучитьФактическиеДанныеПродаж(НачалоПериода, КонецПериода, ТорговыеТочки);
		
		Для Каждого СтрокаСуммы Из СуммыПланаПродаж Цикл 
			НоваяСтрока = ТаблицаПланаПродаж.Добавить();	
			НоваяСтрока.ТорговаяТочка		= СтрокаСуммы.ТорговаяТочка;
			НоваяСтрока.ЛинейныйМенеджер	= СтрокаСуммы.ЛинейныйМенеджер;
			НоваяСтрока.Сумма_План			= СтрокаСуммы.СуммаПлан;
			НоваяСтрока.Сумма_ПредыдущийГод = СтрокаСуммы.СуммаФактПрошлыйГод;
			НоваяСтрока.Сумма_ОтклонениеПредыдущийГод = НоваяСтрока.Сумма_План - НоваяСтрока.Сумма_ПредыдущийГод; 
			
			Для Каждого ДанныеДня Из ДанныеДней Цикл 
				НоваяСтрока.Сумма_Распределено = НоваяСтрока.Сумма_Распределено + СтрокаСуммы[ДанныеДня.КлючКолонки]; 
				НоваяСтрока[КлючиКолонок.Получить(ДанныеДня.НомерНедели)] = НоваяСтрока[КлючиКолонок.Получить(ДанныеДня.НомерНедели)] + СтрокаСуммы[ДанныеДня.КлючКолонки]; 
			КонецЦикла;	
			
			НоваяСтрока.Сумма_Отклонение = НоваяСтрока.Сумма_Распределено - НоваяСтрока.Сумма_План;
			
			// Данные продаж за последние 3 недели
			СтрокиПродажЗаПериод = ПродажиЗаПериод.НайтиСтроки(Новый Структура("ТорговаяТочка", СтрокаСуммы.ТорговаяТочка));
			
			Если СтрокиПродажЗаПериод.Количество() > 0 Тогда 
				НоваяСтрока.Сумма_Факт_Период = СтрокиПродажЗаПериод.Получить(0).Сумма / 3;
			Иначе
				НоваяСтрока.Сумма_Факт_Период = 0;	
			КонецЕсли;	
		КонецЦикла;
		
		СтруктураДанных = Новый Структура();
		СтруктураДанных.Вставить("ПредставлениеДокумента",	ДанныеПланаПродаж.ПредставлениеДокумента);	
		СтруктураДанных.Вставить("ДанныеНедель",			ДанныеНедель);
		СтруктураДанных.Вставить("ТаблицаПланаПродаж",		ТаблицаПланаПродаж);
	Иначе	
		СтруктураДанных = Неопределено;	
	КонецЕсли;	
	
	// Возврат
	Возврат СтруктураДанных;
	
КонецФункции	

#КонецОбласти	

#КонецЕсли
